Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_LCDIFV2.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- LCDIFV2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LCDIFV2_Peripheral_Access_Layer LCDIFV2 Peripheral Access Layer
 * @{
 */

/** LCDIFV2 - Size of Registers Arrays */
#define LCDIFV2_INT_COUNT                         2u
#define LCDIFV2_LAYER_COUNT                       8u

/** LCDIFV2 - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< LCDIFv2 display control Register, offset: 0x0 */
  __IO uint32_t CTRL_SET;                          /**< LCDIFv2 display control Register, offset: 0x4 */
  __IO uint32_t CTRL_CLR;                          /**< LCDIFv2 display control Register, offset: 0x8 */
  __IO uint32_t CTRL_TOG;                          /**< LCDIFv2 display control Register, offset: 0xC */
  __IO uint32_t DISP_PARA;                         /**< Display Parameter Register, offset: 0x10 */
  __IO uint32_t DISP_SIZE;                         /**< Display Size Register, offset: 0x14 */
  __IO uint32_t HSYN_PARA;                         /**< Horizontal Sync Parameter Register, offset: 0x18 */
  __IO uint32_t VSYN_PARA;                         /**< Vertical Sync Parameter Register, offset: 0x1C */
  struct {                                         /* offset: 0x20, array step: 0x10 */
    __IO uint32_t INT_STATUS;                        /**< Interrupt Status Register for domain 0..Interrupt Status Register for domain 1, array offset: 0x20, array step: 0x10 */
    __IO uint32_t INT_ENABLE;                        /**< Interrupt Enable Register for domain 0..Interrupt Enable Register for domain 1, array offset: 0x24, array step: 0x10 */
         uint8_t RESERVED_0[8];
  } INT[LCDIFV2_INT_COUNT];
       uint32_t PDI_PARA;                          /**< Reserved, offset: 0x40 */
       uint8_t RESERVED_0[444];
  struct {                                         /* offset: 0x200, array step: 0x40 */
    __IO uint32_t CTRLDESCL1;                        /**< Control Descriptor Layer 1 Register, array offset: 0x200, array step: 0x40 */
    __IO uint32_t CTRLDESCL2;                        /**< Control Descriptor Layer 2 Register, array offset: 0x204, array step: 0x40 */
    __IO uint32_t CTRLDESCL3;                        /**< Control Descriptor Layer 3 Register, array offset: 0x208, array step: 0x40 */
    __IO uint32_t CTRLDESCL4;                        /**< Control Descriptor Layer 4 Register, array offset: 0x20C, array step: 0x40 */
    __IO uint32_t CTRLDESCL5;                        /**< Control Descriptor Layer 5 Register, array offset: 0x210, array step: 0x40 */
    __IO uint32_t CTRLDESCL6;                        /**< Control Descriptor Layer 6 Register, array offset: 0x214, array step: 0x40 */
    __IO uint32_t CSC_COEF0;                         /**< Color Space Conversion Coefficient Register 0, array offset: 0x218, array step: 0x40, valid indices: [0-1] */
    __IO uint32_t CSC_COEF1;                         /**< Color Space Conversion Coefficient Register 1, array offset: 0x21C, array step: 0x40, valid indices: [0-1] */
    __IO uint32_t CSC_COEF2;                         /**< Color Space Conversion Coefficient Register 2, array offset: 0x220, array step: 0x40, valid indices: [0-1] */
         uint8_t RESERVED_0[28];
  } LAYER[LCDIFV2_LAYER_COUNT];
  __IO uint32_t CLUT_LOAD;                         /**< LCDIFv2 CLUT load Register, offset: 0x400 */
} LCDIFV2_Type;

/* ----------------------------------------------------------------------------
   -- LCDIFV2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LCDIFV2_Register_Masks LCDIFV2 Register Masks
 * @{
 */

/*! @name CTRL - LCDIFv2 display control Register */
/*! @{ */

#define LCDIFV2_CTRL_INV_HS_MASK                 (0x1U)
#define LCDIFV2_CTRL_INV_HS_SHIFT                (0U)
/*! INV_HS - Invert Horizontal synchronization signal
 *  0b0..HSYNC signal not inverted (active HIGH)
 *  0b1..Invert HSYNC signal (active LOW)
 */
#define LCDIFV2_CTRL_INV_HS(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_HS_SHIFT)) & LCDIFV2_CTRL_INV_HS_MASK)

#define LCDIFV2_CTRL_INV_VS_MASK                 (0x2U)
#define LCDIFV2_CTRL_INV_VS_SHIFT                (1U)
/*! INV_VS - Invert Vertical synchronization signal
 *  0b0..VSYNC signal not inverted (active HIGH)
 *  0b1..Invert VSYNC signal (active LOW)
 */
#define LCDIFV2_CTRL_INV_VS(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_VS_SHIFT)) & LCDIFV2_CTRL_INV_VS_MASK)

#define LCDIFV2_CTRL_INV_DE_MASK                 (0x4U)
#define LCDIFV2_CTRL_INV_DE_SHIFT                (2U)
/*! INV_DE - Invert Data Enable polarity
 *  0b0..Data enable is active high
 *  0b1..Data enable is active low
 */
#define LCDIFV2_CTRL_INV_DE(x)                   (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_DE_SHIFT)) & LCDIFV2_CTRL_INV_DE_MASK)

#define LCDIFV2_CTRL_INV_PXCK_MASK               (0x8U)
#define LCDIFV2_CTRL_INV_PXCK_SHIFT              (3U)
/*! INV_PXCK - Polarity change of Pixel Clock
 *  0b0..Display samples data on the falling edge
 *  0b1..Display samples data on the rising edge
 */
#define LCDIFV2_CTRL_INV_PXCK(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_INV_PXCK_MASK)

#define LCDIFV2_CTRL_NEG_MASK                    (0x10U)
#define LCDIFV2_CTRL_NEG_SHIFT                   (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated
 *  0b0..Output is to remain same
 *  0b1..Output to be negated
 */
#define LCDIFV2_CTRL_NEG(x)                      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_NEG_SHIFT)) & LCDIFV2_CTRL_NEG_MASK)

#define LCDIFV2_CTRL_SW_RESET_MASK               (0x80000000U)
#define LCDIFV2_CTRL_SW_RESET_SHIFT              (31U)
/*! SW_RESET - Software Reset
 *  0b0..No action
 *  0b1..All LCDIFv2 internal registers are forced into their reset state. User registers are not affected
 */
#define LCDIFV2_CTRL_SW_RESET(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SW_RESET_SHIFT)) & LCDIFV2_CTRL_SW_RESET_MASK)
/*! @} */

/*! @name CTRL_SET - LCDIFv2 display control Register */
/*! @{ */

