Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_LCDIFV2.h
#define LCDIFV2_CTRL_SET_INV_HS_MASK             (0x1U)
#define LCDIFV2_CTRL_SET_INV_HS_SHIFT            (0U)
/*! INV_HS - Invert Horizontal synchronization signal */
#define LCDIFV2_CTRL_SET_INV_HS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_HS_SHIFT)) & LCDIFV2_CTRL_SET_INV_HS_MASK)

#define LCDIFV2_CTRL_SET_INV_VS_MASK             (0x2U)
#define LCDIFV2_CTRL_SET_INV_VS_SHIFT            (1U)
/*! INV_VS - Invert Vertical synchronization signal */
#define LCDIFV2_CTRL_SET_INV_VS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_VS_SHIFT)) & LCDIFV2_CTRL_SET_INV_VS_MASK)

#define LCDIFV2_CTRL_SET_INV_DE_MASK             (0x4U)
#define LCDIFV2_CTRL_SET_INV_DE_SHIFT            (2U)
/*! INV_DE - Invert Data Enable polarity */
#define LCDIFV2_CTRL_SET_INV_DE(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_DE_SHIFT)) & LCDIFV2_CTRL_SET_INV_DE_MASK)

#define LCDIFV2_CTRL_SET_INV_PXCK_MASK           (0x8U)
#define LCDIFV2_CTRL_SET_INV_PXCK_SHIFT          (3U)
/*! INV_PXCK - Polarity change of Pixel Clock */
#define LCDIFV2_CTRL_SET_INV_PXCK(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_SET_INV_PXCK_MASK)

#define LCDIFV2_CTRL_SET_NEG_MASK                (0x10U)
#define LCDIFV2_CTRL_SET_NEG_SHIFT               (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated */
#define LCDIFV2_CTRL_SET_NEG(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_NEG_SHIFT)) & LCDIFV2_CTRL_SET_NEG_MASK)

#define LCDIFV2_CTRL_SET_SW_RESET_MASK           (0x80000000U)
#define LCDIFV2_CTRL_SET_SW_RESET_SHIFT          (31U)
/*! SW_RESET - Software Reset */
#define LCDIFV2_CTRL_SET_SW_RESET(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_SET_SW_RESET_SHIFT)) & LCDIFV2_CTRL_SET_SW_RESET_MASK)
/*! @} */

/*! @name CTRL_CLR - LCDIFv2 display control Register */
/*! @{ */

#define LCDIFV2_CTRL_CLR_INV_HS_MASK             (0x1U)
#define LCDIFV2_CTRL_CLR_INV_HS_SHIFT            (0U)
/*! INV_HS - Invert Horizontal synchronization signal */
#define LCDIFV2_CTRL_CLR_INV_HS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_HS_SHIFT)) & LCDIFV2_CTRL_CLR_INV_HS_MASK)

#define LCDIFV2_CTRL_CLR_INV_VS_MASK             (0x2U)
#define LCDIFV2_CTRL_CLR_INV_VS_SHIFT            (1U)
/*! INV_VS - Invert Vertical synchronization signal */
#define LCDIFV2_CTRL_CLR_INV_VS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_VS_SHIFT)) & LCDIFV2_CTRL_CLR_INV_VS_MASK)

#define LCDIFV2_CTRL_CLR_INV_DE_MASK             (0x4U)
#define LCDIFV2_CTRL_CLR_INV_DE_SHIFT            (2U)
/*! INV_DE - Invert Data Enable polarity */
#define LCDIFV2_CTRL_CLR_INV_DE(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_DE_SHIFT)) & LCDIFV2_CTRL_CLR_INV_DE_MASK)

#define LCDIFV2_CTRL_CLR_INV_PXCK_MASK           (0x8U)
#define LCDIFV2_CTRL_CLR_INV_PXCK_SHIFT          (3U)
/*! INV_PXCK - Polarity change of Pixel Clock */
#define LCDIFV2_CTRL_CLR_INV_PXCK(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_CLR_INV_PXCK_MASK)

#define LCDIFV2_CTRL_CLR_NEG_MASK                (0x10U)
#define LCDIFV2_CTRL_CLR_NEG_SHIFT               (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated */
#define LCDIFV2_CTRL_CLR_NEG(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_NEG_SHIFT)) & LCDIFV2_CTRL_CLR_NEG_MASK)

#define LCDIFV2_CTRL_CLR_SW_RESET_MASK           (0x80000000U)
#define LCDIFV2_CTRL_CLR_SW_RESET_SHIFT          (31U)
/*! SW_RESET - Software Reset */
#define LCDIFV2_CTRL_CLR_SW_RESET(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_CLR_SW_RESET_SHIFT)) & LCDIFV2_CTRL_CLR_SW_RESET_MASK)
/*! @} */

/*! @name CTRL_TOG - LCDIFv2 display control Register */
/*! @{ */

#define LCDIFV2_CTRL_TOG_INV_HS_MASK             (0x1U)
#define LCDIFV2_CTRL_TOG_INV_HS_SHIFT            (0U)
/*! INV_HS - Invert Horizontal synchronization signal */
#define LCDIFV2_CTRL_TOG_INV_HS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_INV_HS_SHIFT)) & LCDIFV2_CTRL_TOG_INV_HS_MASK)

#define LCDIFV2_CTRL_TOG_INV_VS_MASK             (0x2U)
#define LCDIFV2_CTRL_TOG_INV_VS_SHIFT            (1U)
/*! INV_VS - Invert Vertical synchronization signal */
#define LCDIFV2_CTRL_TOG_INV_VS(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_INV_VS_SHIFT)) & LCDIFV2_CTRL_TOG_INV_VS_MASK)

#define LCDIFV2_CTRL_TOG_INV_DE_MASK             (0x4U)
#define LCDIFV2_CTRL_TOG_INV_DE_SHIFT            (2U)
/*! INV_DE - Invert Data Enable polarity */
#define LCDIFV2_CTRL_TOG_INV_DE(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_INV_DE_SHIFT)) & LCDIFV2_CTRL_TOG_INV_DE_MASK)

#define LCDIFV2_CTRL_TOG_INV_PXCK_MASK           (0x8U)
#define LCDIFV2_CTRL_TOG_INV_PXCK_SHIFT          (3U)
/*! INV_PXCK - Polarity change of Pixel Clock */
#define LCDIFV2_CTRL_TOG_INV_PXCK(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_INV_PXCK_SHIFT)) & LCDIFV2_CTRL_TOG_INV_PXCK_MASK)

#define LCDIFV2_CTRL_TOG_NEG_MASK                (0x10U)
#define LCDIFV2_CTRL_TOG_NEG_SHIFT               (4U)
/*! NEG - Indicates if value at the output (pixel data output) needs to be negated */
#define LCDIFV2_CTRL_TOG_NEG(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_NEG_SHIFT)) & LCDIFV2_CTRL_TOG_NEG_MASK)

#define LCDIFV2_CTRL_TOG_SW_RESET_MASK           (0x80000000U)
#define LCDIFV2_CTRL_TOG_SW_RESET_SHIFT          (31U)
/*! SW_RESET - Software Reset */
#define LCDIFV2_CTRL_TOG_SW_RESET(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRL_TOG_SW_RESET_SHIFT)) & LCDIFV2_CTRL_TOG_SW_RESET_MASK)
/*! @} */

/*! @name DISP_PARA - Display Parameter Register */
/*! @{ */

#define LCDIFV2_DISP_PARA_BGND_B_MASK            (0xFFU)
#define LCDIFV2_DISP_PARA_BGND_B_SHIFT           (0U)
/*! BGND_B - Blue component of the default color displayed in Test Mode 1. */
#define LCDIFV2_DISP_PARA_BGND_B(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_BGND_B_SHIFT)) & LCDIFV2_DISP_PARA_BGND_B_MASK)

#define LCDIFV2_DISP_PARA_BGND_G_MASK            (0xFF00U)
#define LCDIFV2_DISP_PARA_BGND_G_SHIFT           (8U)
/*! BGND_G - Green component of the default color displayed in Test Mode 1. */
#define LCDIFV2_DISP_PARA_BGND_G(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_BGND_G_SHIFT)) & LCDIFV2_DISP_PARA_BGND_G_MASK)

#define LCDIFV2_DISP_PARA_BGND_R_MASK            (0xFF0000U)
#define LCDIFV2_DISP_PARA_BGND_R_SHIFT           (16U)
/*! BGND_R - Red component of the default color displayed in Test Mode 1. */
#define LCDIFV2_DISP_PARA_BGND_R(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_BGND_R_SHIFT)) & LCDIFV2_DISP_PARA_BGND_R_MASK)

