Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_LCDIFV2.h
#define LCDIFV2_DISP_PARA_DISP_MODE_MASK         (0x3000000U)
#define LCDIFV2_DISP_PARA_DISP_MODE_SHIFT        (24U)
/*! DISP_MODE - LCDIFv2 operating mode
 *  0b00..Normal mode. Panel content controlled by layer configuration
 *  0b01..Test Mode1(BGND Color Display)
 *  0b10..Test Mode2(Column Color Bar)
 *  0b11..Test Mode3(Row Color Bar)
 */
#define LCDIFV2_DISP_PARA_DISP_MODE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_DISP_MODE_SHIFT)) & LCDIFV2_DISP_PARA_DISP_MODE_MASK)

#define LCDIFV2_DISP_PARA_LINE_PATTERN_MASK      (0x1C000000U)
#define LCDIFV2_DISP_PARA_LINE_PATTERN_SHIFT     (26U)
/*! LINE_PATTERN - LCDIFv2 line output order
 *  0b000..RGB
 *  0b001..RBG
 *  0b010..GBR
 *  0b011..GRB
 *  0b100..BRG
 *  0b101..BGR
 */
#define LCDIFV2_DISP_PARA_LINE_PATTERN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_LINE_PATTERN_SHIFT)) & LCDIFV2_DISP_PARA_LINE_PATTERN_MASK)

#define LCDIFV2_DISP_PARA_DISP_ON_MASK           (0x80000000U)
#define LCDIFV2_DISP_PARA_DISP_ON_SHIFT          (31U)
/*! DISP_ON - Display panel On/Off mode
 *  0b0..Display Off
 *  0b1..Display On
 */
#define LCDIFV2_DISP_PARA_DISP_ON(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_PARA_DISP_ON_SHIFT)) & LCDIFV2_DISP_PARA_DISP_ON_MASK)
/*! @} */

/*! @name DISP_SIZE - Display Size Register */
/*! @{ */

#define LCDIFV2_DISP_SIZE_DELTA_X_MASK           (0xFFFU)
#define LCDIFV2_DISP_SIZE_DELTA_X_SHIFT          (0U)
/*! DELTA_X - Sets the display size horizontal resolution in pixels */
#define LCDIFV2_DISP_SIZE_DELTA_X(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_SIZE_DELTA_X_SHIFT)) & LCDIFV2_DISP_SIZE_DELTA_X_MASK)

#define LCDIFV2_DISP_SIZE_DELTA_Y_MASK           (0xFFF0000U)
#define LCDIFV2_DISP_SIZE_DELTA_Y_SHIFT          (16U)
/*! DELTA_Y - Sets the display size vertical resolution in pixels */
#define LCDIFV2_DISP_SIZE_DELTA_Y(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_DISP_SIZE_DELTA_Y_SHIFT)) & LCDIFV2_DISP_SIZE_DELTA_Y_MASK)
/*! @} */

/*! @name HSYN_PARA - Horizontal Sync Parameter Register */
/*! @{ */

#define LCDIFV2_HSYN_PARA_FP_H_MASK              (0x1FFU)
#define LCDIFV2_HSYN_PARA_FP_H_SHIFT             (0U)
/*! FP_H - HSYNC front-porch pulse width (in pixel clock cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_HSYN_PARA_FP_H(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_HSYN_PARA_FP_H_SHIFT)) & LCDIFV2_HSYN_PARA_FP_H_MASK)

#define LCDIFV2_HSYN_PARA_PW_H_MASK              (0xFF800U)
#define LCDIFV2_HSYN_PARA_PW_H_SHIFT             (11U)
/*! PW_H - HSYNC active pulse width (in pixel clock cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_HSYN_PARA_PW_H(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_HSYN_PARA_PW_H_SHIFT)) & LCDIFV2_HSYN_PARA_PW_H_MASK)

#define LCDIFV2_HSYN_PARA_BP_H_MASK              (0x7FC00000U)
#define LCDIFV2_HSYN_PARA_BP_H_SHIFT             (22U)
/*! BP_H - HSYNC back-porch pulse width (in pixel clock cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_HSYN_PARA_BP_H(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_HSYN_PARA_BP_H_SHIFT)) & LCDIFV2_HSYN_PARA_BP_H_MASK)
/*! @} */

/*! @name VSYN_PARA - Vertical Sync Parameter Register */
/*! @{ */

#define LCDIFV2_VSYN_PARA_FP_V_MASK              (0x1FFU)
#define LCDIFV2_VSYN_PARA_FP_V_SHIFT             (0U)
/*! FP_V - VSYNC front-porch pulse width (in horizontal line cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_VSYN_PARA_FP_V(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_VSYN_PARA_FP_V_SHIFT)) & LCDIFV2_VSYN_PARA_FP_V_MASK)

#define LCDIFV2_VSYN_PARA_PW_V_MASK              (0xFF800U)
#define LCDIFV2_VSYN_PARA_PW_V_SHIFT             (11U)
/*! PW_V - VSYNC active pulse width (in horizontal line cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_VSYN_PARA_PW_V(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_VSYN_PARA_PW_V_SHIFT)) & LCDIFV2_VSYN_PARA_PW_V_MASK)

#define LCDIFV2_VSYN_PARA_BP_V_MASK              (0x7FC00000U)
#define LCDIFV2_VSYN_PARA_BP_V_SHIFT             (22U)
/*! BP_V - VSYNC back-porch pulse width (in horizontal line cycles). Pulse width has a minimum value of 1 */
#define LCDIFV2_VSYN_PARA_BP_V(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_VSYN_PARA_BP_V_SHIFT)) & LCDIFV2_VSYN_PARA_BP_V_MASK)
/*! @} */

/*! @name INT_STATUS - Interrupt Status Register for domain 0..Interrupt Status Register for domain 1 */
/*! @{ */

#define LCDIFV2_INT_STATUS_VSYNC_MASK            (0x1U)
#define LCDIFV2_INT_STATUS_VSYNC_SHIFT           (0U)
/*! VSYNC - Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame)
 *  0b0..VSYNC has not started
 *  0b1..VSYNC has started
 */
#define LCDIFV2_INT_STATUS_VSYNC(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_VSYNC_SHIFT)) & LCDIFV2_INT_STATUS_VSYNC_MASK)

#define LCDIFV2_INT_STATUS_UNDERRUN_MASK         (0x2U)
#define LCDIFV2_INT_STATUS_UNDERRUN_SHIFT        (1U)
/*! UNDERRUN - Interrupt flag to indicate the output buffer underrun condition
 *  0b0..Output buffer not underrun
 *  0b1..Output buffer underrun
 */
#define LCDIFV2_INT_STATUS_UNDERRUN(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_UNDERRUN_SHIFT)) & LCDIFV2_INT_STATUS_UNDERRUN_MASK)

#define LCDIFV2_INT_STATUS_VS_BLANK_MASK         (0x4U)
#define LCDIFV2_INT_STATUS_VS_BLANK_SHIFT        (2U)
/*! VS_BLANK - Interrupt flag to indicate vertical blanking period
 *  0b0..Vertical blanking period has not started
 *  0b1..Vertical blanking period has started
 */
#define LCDIFV2_INT_STATUS_VS_BLANK(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_VS_BLANK_SHIFT)) & LCDIFV2_INT_STATUS_VS_BLANK_MASK)

#define LCDIFV2_INT_STATUS_DMA_ERR_MASK          (0xFF00U)
#define LCDIFV2_INT_STATUS_DMA_ERR_SHIFT         (8U)
/*! DMA_ERR - Interrupt flag to indicate that which PLANE has Read Error on the AXI interface */
#define LCDIFV2_INT_STATUS_DMA_ERR(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_DMA_ERR_SHIFT)) & LCDIFV2_INT_STATUS_DMA_ERR_MASK)

#define LCDIFV2_INT_STATUS_DMA_DONE_MASK         (0xFF0000U)
#define LCDIFV2_INT_STATUS_DMA_DONE_SHIFT        (16U)
/*! DMA_DONE - Interrupt flag to indicate that which PLANE has fetched the last pixel from memory */
#define LCDIFV2_INT_STATUS_DMA_DONE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_DMA_DONE_SHIFT)) & LCDIFV2_INT_STATUS_DMA_DONE_MASK)

#define LCDIFV2_INT_STATUS_FIFO_EMPTY_MASK       (0xFF000000U)
#define LCDIFV2_INT_STATUS_FIFO_EMPTY_SHIFT      (24U)
/*! FIFO_EMPTY - Interrupt flag to indicate that which FIFO in the pixel blending underflowed */
#define LCDIFV2_INT_STATUS_FIFO_EMPTY(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_FIFO_EMPTY_SHIFT)) & LCDIFV2_INT_STATUS_FIFO_EMPTY_MASK)
/*! @} */

/* The count of LCDIFV2_INT_STATUS */
#define LCDIFV2_INT_STATUS_COUNT                 (2U)

/*! @name INT_ENABLE - Interrupt Enable Register for domain 0..Interrupt Enable Register for domain 1 */
/*! @{ */

#define LCDIFV2_INT_ENABLE_VSYNC_EN_MASK         (0x1U)
#define LCDIFV2_INT_ENABLE_VSYNC_EN_SHIFT        (0U)
/*! VSYNC_EN - Enable Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame)
 *  0b0..VSYNC interrupt disable
 *  0b1..VSYNC interrupt enable
 */
#define LCDIFV2_INT_ENABLE_VSYNC_EN(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_VSYNC_EN_SHIFT)) & LCDIFV2_INT_ENABLE_VSYNC_EN_MASK)

