Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1170/periph/PERI_LCDIFV2.h
#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_MASK     (0xFF0000U)
#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_SHIFT    (16U)
/*! GLOBAL_ALPHA - Global Alpha */
#define LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA(x)       (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_SHIFT)) & LCDIFV2_CTRLDESCL5_GLOBAL_ALPHA_MASK)

#define LCDIFV2_CTRLDESCL5_BPP_MASK              (0xF000000U)
#define LCDIFV2_CTRLDESCL5_BPP_SHIFT             (24U)
/*! BPP - Layer encoding format (bit per pixel)
 *  0b0000..1 bpp
 *  0b0001..2 bpp
 *  0b0010..4 bpp
 *  0b0011..8 bpp
 *  0b0100..16 bpp (RGB565)
 *  0b0101..16 bpp (ARGB1555)
 *  0b0110..16 bpp (ARGB4444)
 *  0b0111..YCbCr422 (Only layer 0/1 can support this format)
 *  0b1000..24 bpp (RGB888)
 *  0b1001..32 bpp (ARGB8888)
 *  0b1010..32 bpp (ABGR8888)
 */
#define LCDIFV2_CTRLDESCL5_BPP(x)                (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_BPP_SHIFT)) & LCDIFV2_CTRLDESCL5_BPP_MASK)

#define LCDIFV2_CTRLDESCL5_SAFETY_EN_MASK        (0x10000000U)
#define LCDIFV2_CTRLDESCL5_SAFETY_EN_SHIFT       (28U)
/*! SAFETY_EN - Safety Mode Enable Bit
 *  0b0..Safety Mode is disabled
 *  0b1..Safety Mode is enabled for this layer
 */
#define LCDIFV2_CTRLDESCL5_SAFETY_EN(x)          (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_SAFETY_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_SAFETY_EN_MASK)

#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_MASK   (0x40000000U)
#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_SHIFT  (30U)
/*! SHADOW_LOAD_EN - Shadow Load Enable */
#define LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_SHADOW_LOAD_EN_MASK)

#define LCDIFV2_CTRLDESCL5_EN_MASK               (0x80000000U)
#define LCDIFV2_CTRLDESCL5_EN_SHIFT              (31U)
/*! EN - Enable the layer for DMA
 *  0b0..OFF
 *  0b1..ON
 */
#define LCDIFV2_CTRLDESCL5_EN(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_EN_SHIFT)) & LCDIFV2_CTRLDESCL5_EN_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL5 */
#define LCDIFV2_CTRLDESCL5_COUNT                 (8U)

/*! @name CTRLDESCL6 - Control Descriptor Layer 6 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL6_BCLR_B_MASK           (0xFFU)
#define LCDIFV2_CTRLDESCL6_BCLR_B_SHIFT          (0U)
/*! BCLR_B - Background B component value */
#define LCDIFV2_CTRLDESCL6_BCLR_B(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_B_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_B_MASK)

#define LCDIFV2_CTRLDESCL6_BCLR_G_MASK           (0xFF00U)
#define LCDIFV2_CTRLDESCL6_BCLR_G_SHIFT          (8U)
/*! BCLR_G - Background G component value */
#define LCDIFV2_CTRLDESCL6_BCLR_G(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_G_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_G_MASK)

#define LCDIFV2_CTRLDESCL6_BCLR_R_MASK           (0xFF0000U)
#define LCDIFV2_CTRLDESCL6_BCLR_R_SHIFT          (16U)
/*! BCLR_R - Background R component value */
#define LCDIFV2_CTRLDESCL6_BCLR_R(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL6_BCLR_R_SHIFT)) & LCDIFV2_CTRLDESCL6_BCLR_R_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL6 */
#define LCDIFV2_CTRLDESCL6_COUNT                 (8U)

/*! @name CSC_COEF0 - Color Space Conversion Coefficient Register 0 */
/*! @{ */

#define LCDIFV2_CSC_COEF0_Y_OFFSET_MASK          (0x1FFU)
#define LCDIFV2_CSC_COEF0_Y_OFFSET_SHIFT         (0U)
/*! Y_OFFSET - Y OFFSET */
#define LCDIFV2_CSC_COEF0_Y_OFFSET(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_Y_OFFSET_SHIFT)) & LCDIFV2_CSC_COEF0_Y_OFFSET_MASK)

#define LCDIFV2_CSC_COEF0_UV_OFFSET_MASK         (0x3FE00U)
#define LCDIFV2_CSC_COEF0_UV_OFFSET_SHIFT        (9U)
/*! UV_OFFSET - UV OFFSET */
#define LCDIFV2_CSC_COEF0_UV_OFFSET(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_UV_OFFSET_SHIFT)) & LCDIFV2_CSC_COEF0_UV_OFFSET_MASK)

#define LCDIFV2_CSC_COEF0_C0_MASK                (0x1FFC0000U)
#define LCDIFV2_CSC_COEF0_C0_SHIFT               (18U)
/*! C0 - Two's compliment Y multiplier coefficient. YUV=0x100 (1.000) YCbCr=0x12A (1.164) */
#define LCDIFV2_CSC_COEF0_C0(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_C0_SHIFT)) & LCDIFV2_CSC_COEF0_C0_MASK)

#define LCDIFV2_CSC_COEF0_ENABLE_MASK            (0x40000000U)
#define LCDIFV2_CSC_COEF0_ENABLE_SHIFT           (30U)
/*! ENABLE - Enable the CSC unit in the LCDIFv2 plane data path
 *  0b0..The CSC is bypassed and the input pixels are RGB data already
 *  0b1..The CSC is enabled and the pixels will be converted to RGB data
 */
#define LCDIFV2_CSC_COEF0_ENABLE(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_ENABLE_SHIFT)) & LCDIFV2_CSC_COEF0_ENABLE_MASK)

#define LCDIFV2_CSC_COEF0_YCBCR_MODE_MASK        (0x80000000U)
#define LCDIFV2_CSC_COEF0_YCBCR_MODE_SHIFT       (31U)
/*! YCBCR_MODE - This bit changes the behavior when performing U/V converting
 *  0b0..Converting YUV to RGB data
 *  0b1..Converting YCbCr to RGB data
 */
#define LCDIFV2_CSC_COEF0_YCBCR_MODE(x)          (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_YCBCR_MODE_SHIFT)) & LCDIFV2_CSC_COEF0_YCBCR_MODE_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF0 */
#define LCDIFV2_CSC_COEF0_COUNT                  (8U)

/*! @name CSC_COEF1 - Color Space Conversion Coefficient Register 1 */
/*! @{ */

#define LCDIFV2_CSC_COEF1_C4_MASK                (0x7FFU)
#define LCDIFV2_CSC_COEF1_C4_SHIFT               (0U)
/*! C4 - Two's compliment Blue U/Cb multiplier coefficient. YUV=0x208 (2.032) YCbCr=0x204 (2.017) */
#define LCDIFV2_CSC_COEF1_C4(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF1_C4_SHIFT)) & LCDIFV2_CSC_COEF1_C4_MASK)

#define LCDIFV2_CSC_COEF1_C1_MASK                (0x7FF0000U)
#define LCDIFV2_CSC_COEF1_C1_SHIFT               (16U)
/*! C1 - Two's compliment Red V/Cr multiplier coefficient. YUV=0x123 (1.140) YCbCr=0x198 (1.596) */
#define LCDIFV2_CSC_COEF1_C1(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF1_C1_SHIFT)) & LCDIFV2_CSC_COEF1_C1_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF1 */
#define LCDIFV2_CSC_COEF1_COUNT                  (8U)

/*! @name CSC_COEF2 - Color Space Conversion Coefficient Register 2 */
/*! @{ */

#define LCDIFV2_CSC_COEF2_C3_MASK                (0x7FFU)
#define LCDIFV2_CSC_COEF2_C3_SHIFT               (0U)
/*! C3 - Two's compliment Green U/Cb multiplier coefficient. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392) */
#define LCDIFV2_CSC_COEF2_C3(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF2_C3_SHIFT)) & LCDIFV2_CSC_COEF2_C3_MASK)

#define LCDIFV2_CSC_COEF2_C2_MASK                (0x7FF0000U)
#define LCDIFV2_CSC_COEF2_C2_SHIFT               (16U)
/*! C2 - Two's compliment Green V/Cr multiplier coefficient. YUV=0x76B (-0.581) YCbCr=0x730 (-0.813) */
#define LCDIFV2_CSC_COEF2_C2(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF2_C2_SHIFT)) & LCDIFV2_CSC_COEF2_C2_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF2 */
#define LCDIFV2_CSC_COEF2_COUNT                  (8U)

/*! @name CLUT_LOAD - LCDIFv2 CLUT load Register */
/*! @{ */

#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_MASK    (0x1U)
#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_SHIFT   (0U)
/*! CLUT_UPDATE_EN - CLUT Update Enable */
#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_SHIFT)) & LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_MASK)

#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_MASK      (0x70U)
#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_SHIFT     (4U)
/*! SEL_CLUT_NUM - Selected CLUT Number */
#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_SHIFT)) & LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group LCDIFV2_Register_Masks */


/*!
 * @}
 */ /* end of group LCDIFV2_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_LCDIFV2_H_ */

